iPig/src/InformationRegisters/Аборт/Аборт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аборт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследнееСобытие</name>
  <attributes>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоследнегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоследнееСобытие</name>
    <type>
      <types>EnumRef.ПоследнееСобытие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоследнееСобытие</name>
  <enumValues>
    <name>Случка</name>
  </enumValues>
  <enumValues>
    <name>УЗИ</name>
  </enumValues>
  <enumValues>
    <name>Опорос</name>
  </enumValues>
  <enumValues>
    <name>Отъем</name>
  </enumValues>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Выбытие</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/InformationRegisters/Аборт/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
		Для Каждого Запись ИЗ ЭтотОбъект Цикл   
		НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
		НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0  Тогда
			ЗаписьСтатус = РегистрыСведений.ПоследнееСобытие.СоздатьМенеджерЗаписи();
			ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
			ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
			ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;  
			ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Аборт; 
			ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
			ЗаписьСтатус.Записать(Истина);
		Иначе                             
			Для Каждого ЗаписьСтатус ИЗ НаборЗаписей Цикл
				Если (Запись.НомерОпороса >= ЗаписьСтатус.НомерОпороса)  И (Запись.Период > ЗаписьСтатус.ДатаПоследнегоСобытия) Тогда
					ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
					ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
					ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;  
					ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Аборт;
					ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
				КонецЕсли;	
			КонецЦикла; 
			НаборЗаписей.Записать(Истина);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры
